// @dart=2.9


List<List<String>> quesTags = [
  //Ram
  ['كسر' ,'حرق' ,'ذاكر' ,'عشوائي' ,'رام', 'ram', 'ضرر', 'تلف', 'RAM'],
  ['وقف' ,'ذاكر' ,'عشوائي', 'ram', 'سلام', 'مادي', 'RAM'],
  ['توافق' , 'شرائح', 'ذاكر', 'عشوائي', 'ram', 'RAM'],
  ['تشغيل', 'مكون', 'قدر', 'حد', 'دنى', 'متطلب'],
  ['ضعف', 'داء', 'ستجاب', 'سرع', 'وضوح', 'وامر', 'برامج', 'لعاب', 'ستهلك'],
  ['عاد', 'تشغيل', 'reboot', 'restart'],
  ['شاش', 'موت', 'زرق', 'ظهور', 'blue', 'screen'],
  // CPU
  ['ظهور', 'شاش', 'سودا', 'معلوم'],
  ['مروح', 'معالج', 'CPU', 'مزود', 'طاق', 'وقف', 'عمل'],
  // Power Supply
  ['عمل', 'صل', 'كهربا', 'وقف'],
  ['بطئ', 'بطيئ'],
  // Mother Board
  ['درج', 'حرار', 'ارتفاع', 'رفع'],
  ['تركيب', 'خط', 'مكون', 'قطع', 'جهاز'],
  ['زر', 'لوح', 'كيبورد', 'عمل', 'مفاتيح'],
  ['مجلد', 'تختف', 'تخزين']
];

List <String> question = [
  //Ram
  'الضرر المادى للذاكرة العشوائية ككسر أو حرق',
  'توقف الذاكرة العشائية عن العمل بالرغم من سلامتها مادياً',
  'توقف الكمبيوتر عن العمل و عرض رسالة تفيد عدم توافق شرائح الذاكرة معاً',
  'ظهور رسالة تفيد بأن الكمبيوتر لا يقابل الحد الأدنى لمتطلبات التشغيل',
  'ضعف أداء الجهاز و عدم استجابته السريعة للأوامر و ظهور مشكلة بوضوح فى الألعاب و البرامج التى تستهلك الذاكرة العشوائية بحجم كبير؟',
  'إعادة تشغيل الجهاز بشكل متكرر بدون أى سابق إنذار؟',
  'ظهور شاشة الموت الزرقاء Blue Screen Of Death',
  // CPU
  'ظهور شاشه سوداء فارغه تماما ولا تظهر أي معلومات علي الشاشه',
  'عمل مروحه المعالج أو مروحة المعالج ومروحة مزود الطاقة لفتره ثم تتوقف لفتره ثم تعاود العمل مره أخري',
  // Power Supply
  'الكمبيوتر لا يعمل على الرغم من أنه متصل بالكهرباء',
  'جهاز الكمبيوتر بطيئ',
  // Mother Board
  'ارتفاع درجة الحرارة الحاسوب',
  'التركيب الخاطئ لقطع جهازك',
  'أحد أزرار لوحة المفاتيح لم يعد يعمل',
  'المجلدات تختفي من وسائط التخزين'
];

List<List<String>> answer = [
  // Ram
  ['ربما يكون مستخدم الكمبيوتر أو القائم بعملية الصيانة هو السبب الرئيسي فيها، حيث تكون الذاكرة العشوائية سليمة و تحتاج إلى صيانة كالتنظيف مثلا ثم تُكسر مما يؤدى إلى تلفها كمكون مادى و توقفها عن العمل، خاصة و أن الذاكرة العشوائية عبارة عن شريحة إلكترونية ضعيفة بعض الشيء و كذلك قد تتعرض الذاكرة العشوائية لتيار كهربائي عنيف أو درجة حرارة مرتفعة جداً يجب استبدال الذاكرة العشوائية بأخرى جديدة'],
  [
    ':أسباب هذه المشكلة: الكهرباء- الكهرباء الساكنة- الحرارة المرتفعة – زيادة تردد تشغيل المعالج – الفيروسات – التركيب الخاطئ للذاكرة العشوائية باللوحة الأم و لحلها',
    '1- تأكد من تركيب الذاكرة العشوائية بشكل سليم فى اللوحة الأم',
    '2- تنظيف شقوق تركيب الذاكرة باللوحة الأم',
    '3- نظف الذاكرة العشوائية نفسها و خاصة من الأسفل',
    '4- جرب الذاكرة العشوائية رام على لوحة أم أخرى أو جهلز كمبيوتر آخر  للتأكد من تلفها',
    '5- للتغلب على ارتفاع درجة الحرارة استخدم مع الذاكرة العشوائية مشتت أو مبدد للحرارة',
    '6- تأكد من خلو الكمبيوتر من الفيروسات، استخدم برامج الحماية المناسبة'
  ],
  ['عند ترقية الذاكرة العشوائية للكمبيوتر بإضافة شرائح ذاكرة عشوائية جديدة يمكن أن تظهر هذه المشكلة، أو عند إضافة ذاكرة عشوائية جديدة و اللوحة الأم بها الحد الأقصى للرام لحل هذه المشكلة؛ يجب التعرف على الحد الأقصى لحجم الذاكرة العشوائية التى يمكن تركيبها باللوحة الأم والتعرف على البيانات التفصيلية لشريحة الذاكرة القديمة مثل حجمها، و سرعة نقل بياناتها و حاول الحصول على ذاكرة عشوائية مماثلة لها تماماً'],
  ['ذلك عندما تكون كمية الذاكرة العشوائية قليلة فلا تعمل العديد من المكونات المادية و البرامج و الألعاب على جهاز الكمبيوتر  و السبب فى ذلك يرجع إلى عدم مقابلة الكمبيوتر للحد الأدنى لمتطلبات تشغيلها،و يتمثل حل هذه المشكلة فى زيادة حجم و كمية الذاكرة العشوائية للكمبيوتر'],
  ['إذا كانت كمية و حجم الذاكرة العشوائية قليلة يؤدى ذلك إلى نقصان و ضعف أداء الجهاز،يتمثل حل هذه المشكلة فى زيادة حجم و كمية الذاكرة العشوائية للكمبيوتر'],
  ['و هذه علامة لخطأ فى الذاكرة العشوائية، وربما تتكرر العملية أكثر من مرة و ربما لا تستطيع الدخول للويندوز من الأساس و لحل هذه المشكلة يجب عليك فحص الذاكرة العشوائية, إذا تأكدت من تلف الذاكرة العشوائبة و جب عليك تغيرها بأخرى'],
  ['عند ظهورها تضطرك إلى إعادة تشغيل الجهاز ولا مفر من ذلك، و ربما يتلف نظام التشغيل بسبب تكرار ظهور تلك الشاشة و لكن الأمر الحسن فى هذه المشكلة أنه يمكنك قراءة رسالة الخطأ قبل إعادة تشغيل الكمبيوتر للتأكد من أنها بسبب الذاكرة العشوائية لحل هذه المشكلة يجب عليك فحص الذاكرة العشوائية،إذا تأكدت من تلف الذاكرة العشوائية و جب عليك تغيرها بأخرى'],
  // CPU
  [
    'عليك ان تفحص المعالج جيدا فأنه قد يكون أحد هذه الاسباب',
    'تلف المعالج وتوقفه عن العمل',
    'التصاق اوساخ أو اتربه وغبار او معجون حراري علي المعالج من أسفل او مكان تركيبه باللوحه الام'
  ],
  ['السبب هو التصاق اوساخ أو أتربة وغبار او معجون حراري علي المعالج او مكان تركيبه باللوحه الأم لذلك عليك فحص المعالج جيدا والتأكد من تنظيفه بشكل مناسب وجيد بأستخدام الفرش المناسبه او قطعه قماش قطنيه او بمنفاخ الهواء في حاله الغبار'],
  // Power Supply
  ['بسبب تلف مزود الطاقة وعدم قدرته على القيام بوظيفته، ولحل هذه المشكلة قم باستبدال مزود الطاقة بآخر يعمل، وقم بتجريبه على الكيسة، فإن عمل الجهاز ووصلت إليه الكهرباء فأصبح من المؤكد أنه يجب عليك استبدال مزود الطاقة لأن به تلف'],
  [
    'تلف مزود الطاقة وعدم قدرته على القيام بوظيفته، ولحل هذه المشكلة قم بتغيير مزود الطاقة كلياً في حالة تلفه',
    'بسبب المكثفات وأيضا التبريد علي الباور سبلاي أو توقف مروحة التبريد عن العمل فهذه المشاكل تؤدي إلي ضعف الكهرباء الموزعة علي أجزاء الحاسوب مثل اللوحة الأم أو الأجزاء الأخرى، ولحل هذه المشكلة قم ب : (التنظيف الدوري للجهاز واستخدام الأدوات والمنظفات المناسبة لمراوح مزود الطاقة وللكمبيوتر ككل- استبدال مراوح تبريد مزود الطاقة في حالة تلفها- تغيير مزود الطاقة كلياً في حالة تلفه- في حالة تلف في المكثفات أو منظمات الجهد التي تتواجد على اللوحة الأم، يجب عليك إصلاح المكثفات ومنظمات الجهد الكهربائي المحيطة بالمعالج في اللوحة الأم عند فني متخصص)'
  ],
  // Mother Board
  ['السبب: استخدام الكمبيوتر على قماش أو كرسي بدلا من استخدامه على سطح خشب او معدن أو تراكب الأتربة والغبار على مروحة تبريد اللوحة الام او وضعه فى مكان به أشعة شمس مباشرة على الجهاز، ولحل هذه المشكلة قم بتلميع مروحة المعالج وحتى المذر بورد من الغبار؛ لأنه مع الزمن سوف تجد أن حاسوبك أصبح مغطى بالغبار والأوساخ، وهذا ما يقلل من قوته ويجعل حاسوبك قليل السرعة وترتفع درجة حرارته، لهذا عليك تنظيف جهازك بشكل دوري- الحرص على وضع جهاز الحاسوب بعيداً عن الشمس وفي مكان يحتوى على تهوية جيدة- الحرص على تغيير العجينة الحرارية في أسرع وقت ممكن، فهي ببساطة عجينة يتم وضعها فوق قطعة المعالج لتساعد على تقليل درجة حرارته- استخدام مروحة أخرى فهذا يساعد على تقليل درجة حرارة الكمبيوتر'],
  ['السبب: ترتيب القطع من الداخل بشكل خاطئ فى اللوحة الأم مما يؤدي لعدم تعرف الجهاز على هذه القطع، ولحل هذه المشكلة قم ب: (احرص بشكل مسمتر على تثبيت القطع في مكانها الصحيح- من الأحسن أن تأخذ جهاز الكمبيوتر إلى أحد المصلحين التقنين المحترفين، بحيث يكون لديك ثقة كبيرة به ليقوم بتركيبها- احرص أيضاً على التركيب الجيد للمذربورد والأسلاك، أيضاً لا تلمس أي قطعة داخل لوحة الأم إن لم تكن لديك خبرة بأجهزة الكمبيوتر)'],
  ['يعني ذلك أنه قد تسرب بعض المياه للوحة المفاتيح، عليك الذهاب لفني الصيانة أو قم بشراء لوحة مفاتيح جديدة'],
  ['جهاز الكمبيوتر الخاص بك يحتوي على فيروس قم مسح شامل لجهازك من خلال برنامج مكافحة الفيروسات وإذا كان غير متوفر لديك قم بتحميله']
];


List<String> checkQuestion(String userInput){
  double maxPercent = 0;
  int maxIndex = -1;
  double quesPercent;
  for(int i = 0; i < quesTags.length; i++){
    quesPercent = calPercent(userInput, i);
    if(quesPercent > maxPercent){
      maxPercent = quesPercent;
      maxIndex = i;
    }
  }
  
  if(maxPercent > 20)
    return answer[maxIndex];
  else{
    if(maxIndex != -1) {
      List<String> ans = answer[maxIndex];
      ans.insert(0, "هل تقصد " + question[maxIndex] + "؟");
      return ans; 
    }
    else 
      return ["غير موجود حاول مرة اخرى"];
  }
}


double calPercent(String userInput, int index){
  int cnt = 0;
  int quesWords =  quesTags[index].length;
  for(int i = 0; i < quesWords; i++){
    if(userInput.contains(quesTags[index][i])){
      cnt++;
    }
  }

  return (cnt.toDouble() / quesWords.toDouble()) * 100.0;
}