// @dart=2.9


import 'package:arabic_chatbot/info_screen.dart';

class categoryData{
  String appBarStr = '';
  List<String> header = [];
  List<String> info = [];

  categoryData(category_t type){
    switch (type) {
      case category_t.RAM:
        appBarStr = 'RAM';
        header = [
          'الضرر المادي للذاكرة العشوائية ككسر أو حرق',
          'توقف الكمبيوتر عن العمل وعرض رسالة تفيد عدم توافق شرائح الذاكرة معاً',
          'ظهور رسالة تفيد بأن الكمبيوتر لا يقابل الحد الأدنى لمتطلبات التشغيل',
          'مشكلة في تشغيل الجهاز وسرعته وأيضاً في تشغيل البرامج وتصفح الانترنت',
          'إعادة تشغيل الجهاز  بشكل متكرر بدون أي سابق إنذار',
          'ظهور شاشة الموت الزرقاء',
        ];
        info = [
          'ربما يكون مستخدم الكمبيوتر أو القائم بعملية الصيانة هو السبب الرئيسي فيها، حيث تكون الذاكرة العشوائية سليمة وتحتاج إلى صيانة كالتنظيف مثلا ثم تُكسر مما يؤدى إلى تلفها كمكون مادي وتوقفها عن العمل، خاصة و أن الذاكرة العشوائية عبارة عن شريحة إلكترونية ضعيفة بعض الشيء و كذلك قد تتعرض الذاكرة العشوائية لتيار كهربائي عنيف أو درجة حرارة مرتفعة جداً يجب استبدال الذاكرة العشوائية بأخرى جديدة',
          'عند ترقية الذاكرة العشوائية للكمبيوتر بإضافة شرائح ذاكرة عشوائية جديدة يمكن أن تظهر هذه المشكلة، أو عند إضافة ذاكرة عشوائية جديدة واللوحة الأم بها الحد الأقصى للرام ولحل هذه المشكلة؛ يجب التعرف على الحد الأقصى لحجم الذاكرة العشوائية التي يمكن تركيبها باللوحة الأم والتعرف على البيانات التفصيلية لشريحة الذاكرة القديمة مثل حجمها، وسرعة نقل بياناتها و حاول الحصول على ذاكرة عشوائية مماثلة لها تماماً',
          'ذلك عندما تكون كمية الذاكرة العشوائية قليلة فلا تعمل العديد من المكونات المادية والبرامج والألعاب على جهاز الكمبيوتر والسبب في ذلك يرجع إلى عدم مقابلة الكمبيوتر للحد الأدنى لمتطلبات تشغيلها، ويتمثل حل هذه المشكلة في زيادة حجم وكمية الذاكرة العشوائية للكمبيوتر',
          'إذا كانت كمية وحجم الذاكرة العشوائية قليلة يؤدى ذلك إلى نقصان وضعف أداء الجهاز، يتمثل حل هذه المشكلة في زيادة حجم وكمية الذاكرة العشوائية للكمبيوتر',
          'وهذه علامة لخطأ في الذاكرة العشوائية، وربما تتكرر العملية أكثر من مرة وربما لا تستطيع الدخول للويندوز من الأساس ولحل هذه المشكلة يجب عليك فحص الذاكرة العشوائية إذا تأكدت من تلف الذاكرة العشوائية وجب عليك تغيرها بأخرى',
          'عند ظهورها تضطرك إلى إعادة تشغيل الجهاز ولا مفر من ذلك، وربما يتلف نظام التشغيل بسبب تكرار ظهور تلك الشاشة ولكن الأمر الحسن في هذه المشكلة أنه يمكنك قراءة رسالة الخطأ قبل إعادة تشغيل الكمبيوتر للتأكد من أنها بسبب الذاكرة العشوائية  لحل هذه المشكلة يجب عليك فحص الذاكرة العشوائية، إذا تأكدت من تلف الذاكرة العشوائية وجب عليك تغيرها بأخرى',
        ];
        break;
      case category_t.CPU:
        appBarStr = 'CPU';
        header = [
          'ظهور شاشه سوداء فارغه تماما ولا تظهر أي معلومات على الشاشة',
          'عمل مروحه المعالج لفتره ثم تتوقف لفتره ثم تعاود العمل مره أخرى',
          'توقف المعالج عن العمل والكمبيوتر لا يعمل',
          'ثني أبر المعالج أثناء تركيبه في المكان المخصص له',
          'توقف الجهاز فجأة أثناء العمل عليه بدون انذار وعند تشغيله مره أخري يعاود العمل ثم يتوقف بعد فتره من التشغيل',
          'تهنيج الجهاز بكثرة وبشكل متكرر',
          'الجهاز بطيء جدا بشكل ملحوظ، وأيضا بطيء في تنفيذ الأوامر',
          'ظهور شاشه زرقاء',
        ];
        info = [
          'يكون ذلك بسبب تلف المعالج وتوقفه عن العمل، أو التصاق أتربة وغبار على المعالج من أسفل',
          'السبب هو التصاق أتربة وغبار على المعالج لذلك عليك فحص المعالج جيدا والتأكد من تنظيفه بشكل مناسب وجيد باستخدام الفرش المناسبة او قطعة قماش قطنية او بمنفاخ الهواء في حاله الغبار',
          'من الممكن ان يكون المعالج قد تم تركيبه بطريقه خاطئة وهذا يعمل على تلف المعالج لذلك أعد تركيبه بالشكل السليم وإذا تلف نهائيا في هذه الحالة عليك تغييره بأخر',
          'عليك أتباع التعليمات الخاصة أثناء التركيب إذا حصل ثني في الابر تواصل مع خبراء وفنيين الصيانة للعمل على إعادة الإبر التي بها عطل إلى شكلها الصحيح. أو قم بتغيير المعالج بآخر في حاله فشل عدم إصلاحه وإعادته مره أخرى',
          'السبب في ذلك هو ارتفاع درجه حرارة المعالج بشكل مبالغ فيه، وفي هذه الحالة عليك تبريده باستخدام أحد وسائل التبريد مثل: مروحه التبريد او المشتت الحراري لخفض درجه حرارته',
          'السبب هو ارتفاع درجه حرارة المعالج، لذا عليك تبريده باستخدام أحد وسائل التبريد المناسبة كمروحة التبريد أو المشتت الحراري، وعليك اتباع أساليب الصيانة الوقائية التي تحمي الجهاز من ارتفاع درجه حرارة المعالج',
          'السبب هو ارتفاع درجه حرارة المعالج، لذا عليك تبريده باستخدام أحد وسائل التبريد المناسبة كمروحة التبريد أو المشتت الحراري. ويجب عليك اتباع أساليب الصيانة الوقائية التي تحمي الجهاز من ارتفاع درجه حرارة المعالج',
          'قد يكون بسبب ارتفاع درجه حرارة المعالج، لذا عليك تبريده باستخدام أحد وسائل التبريد المناسبة كمروحة التبريد أو المشتت الحراري. أو بسبب تراكم الغبار والأتربة على المعالج. ويجب عليك اتباع أساليب الصيانة الوقائية التي تحمي الجهاز من ارتفاع درجه حرارة المعالج وتراكم الغبار عليه',
        ];
        break;
      case category_t.IO_UNITS:
        appBarStr = 'I/O Units';
        header = [
          'مشاكل توصيل وحدات الادخال والإخراج',
          'مشكلة عدم تعرف جهاز الكمبيوتر على وحدات الادخال والإخراج',
          'مشاكل عطل أو تلف وحدات الادخال والإخراج',
        ];
        info = [
          'قد تحدث المشاكل بسبب: توصيل وحدات الادخال بشكل خاطئ. أو منفذ التوصيل في جهاز الكمبيوتر لا يعمل. أو وحدة الادخال والإخراج بها عطل. \nوتكون أعراض هذه المشكلة بأن تتوقف وحدة الادخال أو الإخراج عن العمل. \nولحل هذه المشكلة عليك اتباع ما يلي: التأكد من توصيل وحدة الادخال أو الإخراج بشكل صحيح. أو تجريب وحدة الادخال أو الإخراج في جهاز اخر لتتأكد من أنها تعمل',
          'قد تحدث المشكلة بسبب: لم يتم تثبيت برنامج التعريف الخاص بالوحدة على الكمبيوتر \nوتكون أعراض هذه المشكلة بأن وحدة الادخال أو الإخراج لا تعمل رغم توصيلها بشكل سليم والتأكد من سلامة المنفذ \nولحل هذه المشكلة عليك اتباع ما يلي: تثبيت برنامج تعريف الوحدة من خلال الأسطوانة المرفقة مع الجهاز، وإذا كانت غير متوفرة قم بزيارة موقع الشركة وتحميل برنامج التعريف وتثبيته على الجهاز',
          'قد تحدث المشكلة بسبب: انتهاء عمرها الافتراضي. أو تعرضها للكسر. أو سكب السوائل على وحدة الادخال او الإخراج \n ولحل هذه المشكلة عليك اتباع ما يلي: شراء وحدة ادخال او إخراج جديدة. أو إصلاح وحدة الادخال أو الإخراج عند فني صيانة متخصص',
        ];
        break;
      case category_t.MOTHER_BOARD:
        appBarStr = 'Mother Board';
        header = [
          'ارتفاع درجة الحرارة الحاسوب',
          'التذبذبات الكهربائية أو عنها تغير بشكل مفاجئ في القوة الكهربائية',
          'التركيب الخاطئ لقطع جهازك',
        ];
        info = [
          'استخدام الكمبيوتر على قماش أو كرسي بدلا من استخدامه على سطح خشب او معدن أو تراكب الأتربة والغبار على مروحة تبريد اللوحة الام او وضعه فى مكان به أشعة شمس مباشرة على الجهاز، ولحل هذه المشكلة قم بتلميع مروحة المعالج وحتى المذر بورد من الغبار؛ لأنه مع الزمن سوف تجد أن حاسوبك أصبح مغطى بالغبار والأوساخ، وهذا ما يقلل من قوته ويجعل حاسوبك قليل السرعة وترتفع درجة حرارته، لهذا عليك تنظيف جهازك بشكل دوري- الحرص على وضع جهاز الحاسوب بعيداً عن الشمس وفي مكان يحتوى على تهوية جيدة- الحرص على تغيير العجينة الحرارية في أسرع وقت ممكن، فهي ببساطة عجينة يتم وضعها فوق قطعة المعالج لتساعد على تقليل درجة حرارته- استخدام مروحة أخرى فهذا يساعد على تقليل درجة حرارة الكمبيوتر',
          'انقطاع الكهرباء ورجوعه فجأة أو كثرة انقطاع التيار الكهربى مما يضعف الكهرباء، ولحل هذه المشكلة حاول أن تشتري، وهو جهاز يمنع من التغيرات الكهربائية المفاجئة- حاول إطفاء الحاسوب كلياً عند حدوث عواصف رعدية أو عندما يتكرر انقطاع التيار الكهربائي',
          'ترتيب القطع من الداخل بشكل خاطئ في اللوحة الأم مما يؤدي لعدم تعرف الجهاز على هذه القطع، ولحل هذه المشكلة احرص بشكل مستمر على تثبيت القطع في مكانها الصحيح- من الأحسن أن تأخذ جهاز الكمبيوتر إلى أحد المصلحين التقنين المحترفين، بحيث يكون لديك ثقة كبيرة به ليقوم بتركيبها- احرص أيضاً على التركيب الجيد للوحة الأم والأسلاك، أيضاً لا تلمس أي قطعة داخل لوحة الأم إن لم تكن لديك خبرة بأجهزة الكمبيوتر',
        ];
        break;
      case category_t.POWER_SUPPLY:
        appBarStr = 'Power Supply';
        header = [
          'الكمبيوتر لا يعمل على الرغم من أنه متصل بالكهرباء',
          'مزود الطاقة يعمل، وجهاز الكمبيوتر لا يعرض معلومات على الشاشة',
          'خروج صوت مزعج من مزود الطاقة',
          'ارتفاع درجة حرارة مزود الطاقة',
          'تلف مقابس توصيل الكهرباء لمكونات الكمبيوتر',
        ];
        info = [
          'بسبب تلف مزود الطاقة وعدم قدرته على القيام بوظيفته، ولحل هذه المشكلة قم باستبدال مزود الطاقة بآخر يعمل، وقم بتجريبه على الكيسة، فإن عمل الجهاز ووصلت إليه الكهرباء فأصبح من المؤكد أنه يجب عليك استبدال مزود الطاقة لأن به تلف',
          'بسبب إن مزود الطاقة لا يعطي الكهرباء الكافية لتشغيل اللوحة الأم وذلك بسبب وجود عطل في المكثفات، ولحل هذه المشكلة قم بتغيير مزود الطاقة بآخر جديد',
          'بسبب مروحة التبريد الخاصة بمزود الطاقة لا تعمل بشكل صحيح بسبب عدم كفاءتها أو بسبب تراكم الغبار عليها، ولحل هذه المشكلة قم بالتنظيف الدوري للجهاز واستخدام الأدوات والمنظفات المناسبة لمراوح مزود الطاقة وللكمبيوتر ككل- استبدال مراوح تبريد مزود الطاقة في حالة تلفها- تغيير مزود الطاقة كلياً',
          'بسبب أن المروحة غير قادرة على الأداء لسوء نوعيتها أو بسبب تراكم الغبار عليها، ولحل هذه المشكلة قم بالتنظيف الدوري للجهاز واستخدام الأدوات والمنظفات المناسبة لمراوح مزود الطاقة وللكمبيوتر ككل- استبدال مراوح تبريد مزود الطاقة في حالة تلفها- تغيير مزود الطاقة كلياً',
          'بسبب أن المقابس الخارجة من مزود الطاقة (الأسلاك الخارجة من مزود الطاقة والتي توصل الكهرباء إلى مكونات الكمبيوتر) تحدث بها مشكلة قد تنتج عن سوء التركيب أو بسبب مشكلة كهربية (ماس كهربائي) في المقابس وتظهر رائحة غريبة (شياط) ، ولحل هذه المشكلة قم ب: (قم بإغلاق جهاز الكمبيوتر فوراً وعدم توصيل الكهرباء له حتى تحل المشكلة- إذا كان مزود الطاقة من النوع (بلا أسلاك ولا وصلات ثابتة) فقط قم بتغيير الموصل أو المقبس حيث أن هذا النوع يمكن تغيير موصلاته بسهولة وسرعة- إذا كان مزود الطاقة من النوع (ذو وصلات وأسلاك ثابتة) يكون لديك حلين هما: فصل وقص وعزل الموصل التالف واستخدام محولات لتعويض الموصل التالف، وقص الموصل التالف وشراء آخر ووصل أسلاكه مكانه، ولكن هذا قد يحتاج إلى فني متخصص وأدوات معينة مثل مكواة اللحام، وفي حالة فشل هذه المحاولة يجب عليك تغيير مزود الطاقة كلياً',
        ];
        break;
      case category_t.COMPUTER_CASE:
        appBarStr = 'Computer Case';
        header = [
          'تلف كابل إمداد الكمبيوتر بالكهرباء',
          'تلف صندوق النظام كلياً أو جزئياً',
          'عدم عمل منافذ الاتصال الامامية',
          'تلف زر تشغيل الجهاز أو زر إعادة التشغيل أو كلاهما',
          'تلف مراوح تبريد صندوق النظام',
          'تلف الباب الجانبي لصندوق النظام'
        ];
        info = [
          'من المشاكل البسيطة وسريعة الحل والاكتشاف، فعند تلف كابل امداد الكمبيوتر بالكهرباء يمكنك تغييره بأخر تكلفته زهيدة، وأحياناً يتلف الكابل بسبب قطعه خاصة إذا كان مكتب الكمبيوتر يتحرك كثيراً. وستتعرف على المشكلة عند توقف الكمبيوتر عن العمل بسبب الكهرباء، وعند تغيير الكابل بأخر نجد الكهرباء وصلت للكمبيوتر ويعمل بشكل طبيعي',
          'يتعرض صندوق النظام للكسر أو الوقوع من على المكتب الحامل له مما يتسبب بتلف جزئي أو كلي، وفي بعض الأحيان قد تضطر إلى تغيير الكيسة بأخرى ونقل المكونات الداخلية منها \n وللتغلب على هذه المشكلة وحلها: \n -	اختيار المكان المناسب لوضع مكتب الكمبيوتر، حتى لا تتعرض للوقوع \n -	اختيار مكتب مناسب، لا يتسم بالاهتزاز وعدم الثبات \n -	الاحتراس من الأطفال وأماكن لعبهم \n -	وضع الكابلات في أمكان بعيدة عن المارة حتى لا يعلق أحد الكابلات بأقدام المارة وبالتالي تقع الكيسة',
          'الكيسة بها من الأمام منافذ توصيل مثل منافذ الفلاش ومنافذ الصوت، وفي بعض الأحيان لا تعمل هذه المنافذ أو تتوقف عن العمل \n وللتغلب على هذه المشكلة وحلها: \n -	التأكد من توصيل أسلاك ومقابس منافذ الاتصال الأمامية الموجودة بالكيسة باللوحة الأم من الداخل \n -	في بعض الأحيان تكون منافذ التوصيل الأمامية مغلقة من داخل نظام التشغيل بخاصة الصوت أو من دخل البايوس والتي نتحكم من خلالها بمكونات الجهاز المادية \n -	في بعض قد يكون التلف بالمنفذ نفسه، وهنا يجب تغيير المنفذ نفسه من الكيسة بأخر',
          'قد تحتوي بعض الكيسات على كلا الزرين وقد تحتوي بعضهم على زر التشغيل فقط وتتمثل المشكلة هنا في تلف أحد هذين الزرين أو كلاهما \n وللتغلب على هذه المشكلة وحلها: \n -	التأكد من توصيل كلا الزرين من الكيسة باللوحة الأم من الداخل، وغالباً ما تكون صفين من الابر وتتصل بمقبس توصيل من الأمام ويكون مكتوب عليه وظيفته \n -	قد يتلف الزر نفسه بسبب كثرة الاستخدام مع وجود أتربة وغبار يؤديان إلى عمل الزر بشكل غير منتظم فقد تضغط عليه فيظل مضغوط للداخل، هذا بدوره يستوجب تغيير الزر فورا بأخر من خلال فك الكيسة من الأمام وفك مسماري الزر وتغييره',
          'توجد مراوح تبريد الكيسة في أمكان متعددة مثل الباب الجانبي فقط أو الخلف وفي الباب وكذلك من الأمام فهي تختلف من كيسة لأخرى \n وللتغلب على هذه المشكلة وحلها: \n -	تغيير المروحة بأخرى سليمة، بشرط أن تناسبها في الحجم وفي نفس المكان. \n -	يمكنك فصل المروحة أو ايقافها عن العمل حسب الحاجة أو حتى يمكنك تغييرها بأخرى فإيقافها عن العمل قد يؤدي إلى حل المشكلة، ويتم إيقاف المروحة عن العمل من خلال فصل الكهرباء عنها، حيث يتم توصيلها بمزود الطاقة للحصول على الكهرباء في الغالب من خلال وصلة موليكس أو ساتا',
          'من المعروف أن كل صندوق النظام يكون له باب جانبي يسمح عند فتحه بالوصول إلى مكونات الكمبيوتر الداخلية، في بعض الأحيان قد يؤدي سوء التركيب إلى تلف الباب وهكذا لن يمكننا إغلاقه مما يؤدي إلى تعرض المكونات الداخلية للأتربة والغبار والعديد من المشاكل \n وللتغلب على هذه المشكلة وحلها:\n -	محاولة إصلاح الباب نفسه، وقد توجد به بعض الانحناءات التي يمكن إصلاحها\n -	محاولة تغييره بأخر إن توفر ذلك \n -	وفي النهاية قد تضطر لتغيير صندوق النظام ككل',
        ];
        break;
      default:
        break;
    }
  }
  

}